package home10;

public class Main {
    public static void main(String[] args) {
        //Загрузить файл "Yes/No" -> "Y/N"
        //Выбор дейсьвия "Отобразть/Найти/Добавить"->"1/2/3"
             //1) Отобразить "Все/По типу" -> "1/2"
             //2) Выбор типв поисуа "/////"->"1/2/3/.../"
             //3) Введтье параметр поиска:
       //Добавить
             //1) Выберите "Тип"
             //2) Выберете категорию "Категория"
             //3) Введите данные книги
        //Обновить файл "Yes/No" -> "Y/N"

    }
}
